Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.storage.clearAll.description
source: Delete all rebuildable local cache and generated files. Starcat may need to fetch, translate, or regenerate content again.
ar: حذف كل الذاكرة المؤقتة المحلية القابلة لإعادة البناء والملفات المنشأة. قد يحتاج Starcat إلى جلب المحتوى أو ترجمته أو إنشائه مرة أخرى.
de: Löscht alle wiederherstellbaren lokalen Cache- und generierten Dateien. Starcat muss möglicherweise erneut Inhalte abrufen, übersetzen oder generieren.
es: Elimina toda la caché local y archivos generados que se pueden reconstruir. Es posible que Starcat necesite obtener, traducir o regenerar contenido nuevamente.
fr: Supprime tout le cache local et les fichiers générés reconstructibles. Starcat devra peut-être récupérer, traduire ou régénérer du contenu.
id: Hapus semua cache lokal yang dapat dibangun ulang dan file yang dibuat. Starcat mungkin perlu mengambil, menerjemahkan, atau membuat ulang konten lagi.
it: Elimina tutta la cache locale ricostruibile e i file generati. Starcat potrebbe dover recuperare, tradurre o rigenerare i contenuti.
ja: 再構築可能なローカルキャッシュと生成ファイルをすべて削除します。Starcatは再度コンテンツの取得、翻訳、生成を行う必要がある場合があります。
ko: 재구성 가능한 모든 로컬 캐시와 생성된 파일을 삭제합니다. Starcat이 콘텐츠를 다시 가져오거나, 번역하거나, 재생성해야 할 수 있습니다.
nl: Verwijder alle herbouwbare lokale cache en gegenereerde bestanden. Starcat moet mogelijk opnieuw ophalen, vertalen of genereren.
pl: Usuń wszystkie możliwe do odtworzenia lokalne pliki pamięci podręcznej i wygenerowane pliki. Starcat może ponownie pobrać, przetłumaczyć lub wygenerować treści.
pt_br: Exclui todo o cache local reconstruível e arquivos gerados. O Starcat pode precisar buscar, traduzir ou gerar conteúdo novamente.
ru: Удалить весь восстанавливаемый локальный кэш и сгенерированные файлы. Starcat может потребоваться повторно загрузить, перевести или сгенерировать содержимое.
tr: Yeniden oluşturulabilir tüm yerel önbelleği ve oluşturulan dosyaları siler. Starcat içeriği tekrar getirmek, çevirmek veya yeniden oluşturmak zorunda kalabilir.
uk: Видалити весь локальний кеш і згенеровані файли, які можна відновити. Starcat може знову завантажувати, перекладати або генерувати вміст.
vi: Xóa tất cả bộ nhớ đệm cục bộ có thể xây dựng lại và các tệp đã tạo. Starcat có thể cần tải, dịch hoặc tạo lại nội dung.
zh_hans: 删除所有可重建的本机缓存和生成文件。之后 Starcat 可能需要重新拉取、翻译或生成内容。
zh_hant: 删除所有可重建的本地缓存和生成文件。之后 Starcat 可能需要重新获取、翻译或生成内容。

# settings.storage.clearAll.message
source: Same as clearing every cache above (README, images, downloaded ZIPs, translation, search, Code Context, CodeFlow).
ar: مثل مسح كل ذاكرة مؤقتة أعلاه (README، الصور، ملفات ZIP المحمّلة، الترجمة، البحث، سياق الكود، CodeFlow).
de: Entspricht dem Löschen aller Caches oben (README, Bilder, heruntergeladene ZIPs, Übersetzung, Suche, Code-Kontext, CodeFlow).
es: Equivale a limpiar todas las cachés anteriores (README, imágenes, ZIP descargados, traducción, búsqueda, contexto de código, CodeFlow).
fr: Équivaut à effacer chaque cache ci-dessus (README, images, ZIP téléchargés, traduction, recherche, contexte de code, CodeFlow).
id: Sama seperti menghapus setiap cache di atas (README, gambar, ZIP yang diunduh, terjemahan, pencarian, Konteks Kode, CodeFlow).
it: Equivale a cancellare ogni cache sopra (README, immagini, ZIP scaricati, traduzione, ricerca, contesto codice, CodeFlow).
ja: 上記のすべてのキャッシュ（README、画像、ダウンロードしたZIP、翻訳、検索、コードコンテキスト、CodeFlow）をクリアするのと同じです。
ko: 위의 모든 캐시(README, 이미지, 다운로드된 ZIP, 번역, 검색, 코드 컨텍스트, CodeFlow)를 지우는 것과 같습니다.
nl: Hetzelfde als het wissen van alle bovenstaande caches (README, afbeeldingen, gedownloade ZIP's, vertaling, zoekopdracht, codecontext, CodeFlow).
pl: To samo, co wyczyszczenie każdej pamięci podręcznej powyżej (README, obrazy, pobrane ZIP, tłumaczenia, wyszukiwanie, kontekst kodu, CodeFlow).
pt_br: O mesmo que limpar cada cache acima (README, imagens, ZIPs baixados, tradução, pesquisa, Contexto do Código, CodeFlow).
ru: То же, что очистка каждого кэша выше (README, изображения, загруженные ZIP, переводы, поиск, контекст кода, CodeFlow).
tr: Yukarıdaki tüm önbellekleri temizlemekle aynı (README, resimler, indirilen ZIP'ler, çeviri, arama, Kod Bağlamı, CodeFlow).
uk: Те саме, що очищення кожного кешу вище (README, зображення, завантажені ZIP, переклад, пошук, контекст коду, CodeFlow).
vi: Tương tự như xóa từng bộ nhớ đệm ở trên (README, hình ảnh, ZIP đã tải, bản dịch, tìm kiếm, Ngữ cảnh mã, CodeFlow).
zh_hans: 等同于一次性清理上面所有缓存（README、图片、已下载的仓库 ZIP、翻译、搜索、代码上下文、CodeFlow）。
zh_hant: 等同于一次性清除上述所有缓存（README、图片、已下载的仓库 ZIP、翻译、搜索、代码上下文、CodeFlow）。

# settings.storage.clearAll.scope.generated
source: Generated Code Context and CodeFlow files.
ar: ملفات سياق الكود و CodeFlow المنشأة.
de: Generierte Code-Kontext- und CodeFlow-Dateien.
es: Archivos generados de contexto de código y CodeFlow.
fr: Fichiers de contexte de code et CodeFlow générés.
id: File Konteks Kode dan CodeFlow yang dibuat.
it: File generati di contesto codice e CodeFlow.
ja: 生成されたコードコンテキストとCodeFlowファイル。
ko: 생성된 코드 컨텍스트 및 CodeFlow 파일.
nl: Gegenereerde codecontext- en CodeFlow-bestanden.
pl: Wygenerowane pliki kontekstu kodu i CodeFlow.
pt_br: Arquivos gerados de Contexto do Código e CodeFlow.
ru: Сгенерированные файлы контекста кода и CodeFlow.
tr: Oluşturulan Kod Bağlamı ve CodeFlow dosyaları.
uk: Згенеровані файли контексту коду та CodeFlow.
vi: Các tệp Ngữ cảnh mã và CodeFlow đã tạo.
zh_hans: 已生成的 Code Context 与 CodeFlow 文件。
zh_hant: 已生成的 Code Context 与 CodeFlow 文件。

# settings.storage.clearAll.scope.localDataSafe
source: Local SQLite data, tags, notes, status, credentials, GitHub, CloudKit, and backend data are not modified.
ar: لا يتم تعديل بيانات SQLite المحلية، العلامات، الملاحظات، الحالة، بيانات الاعتماد، GitHub، CloudKit، وبيانات الواجهة الخلفية.
de: Lokale SQLite-Daten, Tags, Notizen, Status, Anmeldedaten, GitHub, CloudKit und Backend-Daten werden nicht geändert.
es: Los datos locales de SQLite, etiquetas, notas, estado, credenciales, GitHub, CloudKit y datos de backend no se modifican.
fr: Les données locales SQLite, tags, notes, statut, identifiants, GitHub, CloudKit et les données backend ne sont pas modifiées.
id: Data SQLite lokal, tag, catatan, status, kredensial, GitHub, CloudKit, dan data backend tidak dimodifikasi.
it: I dati locali SQLite, tag, note, stato, credenziali, GitHub, CloudKit e backend non vengono modificati.
ja: ローカルのSQLiteデータ、タグ、メモ、ステータス、認証情報、GitHub、CloudKit、バックエンドデータは変更されません。
ko: 로컬 SQLite 데이터, 태그, 노트, 상태, 자격 증명, GitHub, CloudKit 및 백엔드 데이터는 수정되지 않습니다.
nl: Lokale SQLite-gegevens, tags, notities, status, inloggegevens, GitHub, CloudKit en backendgegevens worden niet gewijzigd.
pl: Lokalne dane SQLite, tagi, notatki, status, dane uwierzytelniające, GitHub, CloudKit i dane backendu nie są modyfikowane.
pt_br: Dados locais do SQLite, etiquetas, notas, status, credenciais, GitHub, CloudKit e dados de backend não são modificados.
ru: Локальные данные SQLite, теги, заметки, статус, учётные данные, GitHub, CloudKit и данные бэкенда не изменяются.
tr: Yerel SQLite verileri, etiketler, notlar, durum, kimlik bilgileri, GitHub, CloudKit ve arka uç verileri değiştirilmez.
uk: Локальні дані SQLite, теги, нотатки, статус, облікові дані, GitHub, CloudKit та дані серверної частини не змінюються.
vi: Dữ liệu SQLite cục bộ, thẻ, ghi chú, trạng thái, thông tin xác thực, GitHub, CloudKit và dữ liệu backend không bị sửa đổi.
zh_hans: 不会修改本地 SQLite 数据、标签、笔记、状态、凭据、GitHub、CloudKit 或后端数据。
zh_hant: 不会修改本地 SQLite 数据、标签、笔记、状态、凭据、GitHub、CloudKit 或后端数据。

# settings.storage.clearAll.scope.media
source: Image cache and downloaded repository ZIP archives.
ar: ذاكرة الصور المؤقتة وأرشيفات ZIP للمستودعات المحمّلة.
de: Bildercache und heruntergeladene Repository-ZIP-Archive.
es: Caché de imágenes y archivos ZIP de repositorios descargados.
fr: Cache d'images et archives ZIP de dépôts téléchargés.
id: Cache gambar dan arsip ZIP repositori yang diunduh.
it: Cache immagini e archivi ZIP repository scaricati.
ja: 画像キャッシュとダウンロードしたリポジトリZIPアーカイブ。
ko: 이미지 캐시 및 다운로드된 저장소 ZIP 아카이브.
nl: Afbeeldingscache en gedownloade repository-ZIP-archieven.
pl: Pamięć podręczna obrazów i pobrane archiwa ZIP repozytoriów.
pt_br: Cache de imagens e arquivos ZIP de repositórios baixados.
ru: Кэш изображений и загруженные ZIP-архивы репозиториев.
tr: Resim önbelleği ve indirilen depo ZIP arşivleri.
uk: Кеш зображень і завантажені ZIP-архіви репозиторіїв.
vi: Bộ nhớ đệm hình ảnh và kho lưu trữ ZIP đã tải về.
zh_hans: 图片缓存和已下载的仓库 ZIP。
zh_hant: 图片缓存和已下载的仓库 ZIP 压缩包。

# settings.storage.clearAll.scope.readme
source: README cache, AI translation cache, and chat history cache.
ar: ذاكرة README المؤقتة، ذاكرة ترجمة الذكاء الاصطناعي المؤقتة، وذاكرة سجل الدردشة المؤقتة.
de: README-Cache, KI-Übersetzungs-Cache und Chatverlauf-Cache.
es: Caché de README, caché de traducción de IA y caché de historial de chat.
fr: Cache README, cache de traduction IA et cache d'historique des discussions.
id: Cache README, cache terjemahan AI, dan cache riwayat obrolan.
it: Cache README, cache traduzione AI e cache cronologia chat.
ja: READMEキャッシュ、AI翻訳キャッシュ、チャット履歴キャッシュ。
ko: README 캐시, AI 번역 캐시 및 채팅 기록 캐시.
nl: README-cache, AI-vertaalcache en chatgeschiedeniscache.
pl: Pamięć podręczna README, pamięć podręczna tłumaczeń AI i pamięć podręczna historii czatu.
pt_br: Cache de README, cache de tradução de IA e cache de histórico de chat.
ru: Кэш README, кэш переводов ИИ и кэш истории чата.
tr: README önbelleği, AI çeviri önbelleği ve sohbet geçmişi önbelleği.
uk: Кеш README, кеш AI-перекладу та кеш історії чату.
vi: Bộ nhớ đệm README, bộ nhớ đệm bản dịch AI và bộ nhớ đệm lịch sử trò chuyện.
zh_hans: README 缓存、AI 翻译缓存和对话历史缓存。
zh_hant: README 缓存、AI 翻译缓存和对话历史缓存。

# settings.storage.clearAll.scope.searchWiki
source: Search cache and Wiki probe cache.
ar: ذاكرة البحث المؤقتة وذاكرة فحص الويكي المؤقتة.
de: Suchcache und Wiki-Erkundungs-Cache.
es: Caché de búsqueda y caché de sonda Wiki.
fr: Cache de recherche et cache de sondage Wiki.
id: Cache pencarian dan cache probe Wiki.
it: Cache ricerca e cache probe Wiki.
ja: 検索キャッシュとWikiプローブキャッシュ。
ko: 검색 캐시 및 Wiki 프로브 캐시.
nl: Zoekcache en Wiki-probecache.
pl: Pamięć podręczna wyszukiwania i pamięć podręczna sondowania Wiki.
pt_br: Cache de pesquisa e cache de sondagem Wiki.
ru: Кэш поиска и кэш зондирования Wiki.
tr: Arama önbelleği ve Wiki yoklama önbelleği.
uk: Кеш пошуку та кеш зондів Wiki.
vi: Bộ nhớ đệm tìm kiếm và bộ nhớ đệm thăm dò Wiki.
zh_hans: 搜索缓存和 Wiki 探测缓存。
zh_hant: 搜索缓存和 Wiki 探测缓存。

# settings.storage.clearAll.scope.title
source: This will delete:
ar: سيؤدي هذا إلى حذف:
de: Dies wird gelöscht:
es: Esto eliminará:
fr: Cela supprimera :
id: Ini akan menghapus:
it: Questo eliminerà:
ja: これにより削除されるもの：
ko: 다음이 삭제됩니다:
nl: Dit wordt verwijderd:
pl: Spowoduje to usunięcie:
pt_br: Isso excluirá:
ru: Будет удалено:
tr: Bu silinecek:
uk: Буде видалено:
vi: Thao tác này sẽ xóa:
zh_hans: 将删除以下本机缓存：
zh_hant: 将删除以下内容：

# settings.storage.clearAll.sheet.note
source: Only remove the reconstructible cache, and these data will be recached as needed.
ar: إزالة الذاكرة المؤقتة القابلة لإعادة البناء فقط، وستُعاد تخزين هذه البيانات مؤقتًا حسب الحاجة.
de: Nur den wiederherstellbaren Cache entfernen; diese Daten werden bei Bedarf erneut zwischengespeichert.
es: Solo elimina la caché reconstruible; estos datos se volverán a almacenar en caché según sea necesario.
fr: Supprime uniquement le cache reconstructible ; ces données seront remises en cache si nécessaire.
id: Hanya hapus cache yang dapat dibangun ulang, dan data ini akan di-cache ulang sesuai kebutuhan.
it: Rimuove solo la cache ricostruibile; questi dati verranno ricaricati quando necessario.
ja: 再構築可能なキャッシュのみを削除します。これらのデータは必要に応じて再キャッシュされます。
ko: 재구성 가능한 캐시만 제거하며, 필요에 따라 다시 캐시됩니다.
nl: Verwijder alleen de herbouwbare cache; deze gegevens worden indien nodig opnieuw gecachet.
pl: Usuń tylko odtwarzalną pamięć podręczną; te dane zostaną ponownie zapisane w razie potrzeby.
pt_br: Remova apenas o cache reconstruível, e esses dados serão recriados conforme necessário.
ru: Удаляется только восстанавливаемый кэш; эти данные будут повторно кэшированы по мере необходимости.
tr: Yalnızca yeniden oluşturulabilir önbelleği kaldırır, bu veriler ihtiyaç duyuldukça yeniden önbelleğe alınır.
uk: Видаляється лише відновлюваний кеш; ці дані будуть повторно закешовані за потреби.
vi: Chỉ xóa bộ nhớ đệm có thể tái tạo và dữ liệu này sẽ được lưu lại khi cần.
zh_hans: 这只会移除可重建缓存，在必要时会重新缓存这些数据。
zh_hant: 仅移除可重建的缓存，这些数据会在需要时重新缓存。

# settings.storage.clearAll.sheet.subtitle
source: This cannot be undone, but Starcat can rebuild these files when needed.
ar: لا يمكن التراجع عن هذا، لكن يمكن لـ Starcat إعادة بناء هذه الملفات عند الحاجة.
de: Dies kann nicht rückgängig gemacht werden, aber Starcat kann diese Dateien bei Bedarf neu erstellen.
es: Esto no se puede deshacer, pero Starcat puede reconstruir estos archivos cuando sea necesario.
fr: Cette action est irréversible, mais Starcat peut reconstruire ces fichiers quand nécessaire.
id: Ini tidak dapat dibatalkan, tetapi Starcat dapat membangun ulang file-file ini saat diperlukan.
it: Questa operazione non può essere annullata, ma Starcat può ricostruire questi file quando necessario.
ja: この操作は元に戻せませんが、Starcatは必要に応じてこれらのファイルを再構築できます。
ko: 실행 취소할 수 없지만, Starcat이 필요할 때 이 파일들을 다시 빌드할 수 있습니다.
nl: Dit kan niet ongedaan worden gemaakt, maar Starcat kan deze bestanden indien nodig opnieuw opbouwen.
pl: Tej operacji nie można cofnąć, ale Starcat może odtworzyć te pliki w razie potrzeby.
pt_br: Isso não pode ser desfeito, mas o Starcat pode reconstruir esses arquivos quando necessário.
ru: Это действие нельзя отменить, но Starcat может восстановить эти файлы при необходимости.
tr: Bu geri alınamaz, ancak Starcat bu dosyaları gerektiğinde yeniden oluşturabilir.
uk: Цю дію не можна скасувати, але Starcat може відновити ці файли, коли це буде потрібно.
vi: Không thể hoàn tác, nhưng Starcat có thể xây dựng lại các tệp này khi cần.
zh_hans: 此操作无法撤销，但 Starcat 后续可按需重新构建这些文件。
zh_hant: 此操作无法撤销，但 Starcat 后续可按需重新构建这些文件。

# settings.storage.clearAll.sheet.title
source: Delete All Cache?
ar: حذف كل الذاكرة المؤقتة؟
de: Gesamten Cache löschen?
es: ¿Eliminar toda la caché?
fr: Supprimer tout le cache ?
id: Hapus Semua Cache?
it: Eliminare tutta la cache?
ja: すべてのキャッシュを削除しますか？
ko: 모든 캐시를 삭제하시겠습니까?
nl: Alle cache verwijderen?
pl: Usunąć całą pamięć podręczną?
pt_br: Excluir Todo o Cache?
ru: Удалить весь кэш?
tr: Tüm Önbellek Silinsin mi?
uk: Видалити весь кеш?
vi: Xóa tất cả bộ nhớ đệm?
zh_hans: 删除全部缓存？
zh_hant: 删除全部缓存？

# settings.storage.clearAnySearch
source: Clear External Search Cache
ar: مسح ذاكرة البحث الخارجي المؤقتة
de: Externen Suchcache löschen
es: Limpiar caché de búsqueda externa
fr: Effacer le cache de recherche externe
id: Hapus Cache Pencarian Eksternal
it: Cancella cache ricerca esterna
ja: 外部検索キャッシュをクリア
ko: 외부 검색 캐시 지우기
nl: Externe zoekcache wissen
pl: Wyczyść pamięć podręczną wyszukiwania zewnętrznego
pt_br: Limpar Cache de Pesquisa Externa
ru: Очистить кэш внешнего поиска
tr: Harici Arama Önbelleğini Temizle
uk: Очистити кеш зовнішнього пошуку
vi: Xóa bộ nhớ đệm tìm kiếm bên ngoài
zh_hans: 清除外部搜索缓存
zh_hant: 清除外部搜索缓存

# settings.storage.clearAnySearch.action
source: Clear
ar: مسح
de: Löschen
es: Limpiar
fr: Effacer
id: Hapus
it: Cancella
ja: クリア
ko: 지우기
nl: Wissen
pl: Wyczyść
pt_br: Limpar
ru: Очистить
tr: Temizle
uk: Очистити
vi: Xóa
zh_hans: 清除
zh_hant: 清除

# settings.storage.clearAnySearch.confirm
source: Clear all External Search cache?
ar: مسح كل ذاكرة البحث الخارجي المؤقتة؟
de: Gesamten externen Suchcache löschen?
es: ¿Limpiar toda la caché de búsqueda externa?
fr: Effacer tout le cache de recherche externe ?
id: Hapus semua cache Pencarian Eksternal?
it: Cancellare tutta la cache di ricerca esterna?
ja: すべての外部検索キャッシュをクリアしますか？
ko: 모든 외부 검색 캐시를 지우시겠습니까?
nl: Alle externe zoekcache wissen?
pl: Wyczyścić całą pamięć podręczną wyszukiwania zewnętrznego?
pt_br: Limpar todo o cache de Pesquisa Externa?
ru: Очистить весь кэш внешнего поиска?
tr: Tüm Harici Arama önbelleği temizlensin mi?
uk: Очистити весь кеш зовнішнього пошуку?
vi: Xóa tất cả bộ nhớ đệm tìm kiếm bên ngoài?
zh_hans: 确认清除全部外部搜索缓存？
zh_hant: 确认清除全部外部搜索缓存？

# settings.storage.clearAnySearch.message
source: All cached External Search results (global search + AI external context) will be removed. Subsequent searches and summaries will re-query the network and consume API quota.
ar: ستُزال جميع نتائج البحث الخارجي المخزنة مؤقتًا (البحث العام + السياق الخارجي للذكاء الاصطناعي). ستعيد عمليات البحث والملخصات اللاحقة الاستعلام عبر الشبكة وتستهلك حصة API.
de: Alle zwischengespeicherten externen Suchergebnisse (globale Suche + KI-externer Kontext) werden entfernt. Nachfolgende Suchen und Zusammenfassungen werden das Netzwerk erneut abfragen und API-Kontingent verbrauchen.
es: Se eliminarán todos los resultados de búsqueda externa almacenados en caché (búsqueda global + contexto externo de IA). Las búsquedas y resúmenes posteriores volverán a consultar la red y consumirán cuota de API.
fr: Tous les résultats de recherche externe mis en cache (recherche globale + contexte IA externe) seront supprimés. Les recherches et résumés ultérieurs interrogeront à nouveau le réseau et consommeront le quota API.
id: Semua hasil Pencarian Eksternal yang di-cache (pencarian global + konteks eksternal AI) akan dihapus. Pencarian dan ringkasan selanjutnya akan meminta ulang jaringan dan menggunakan kuota API.
it: Tutti i risultati di ricerca esterna memorizzati nella cache (ricerca globale + contesto esterno AI) verranno rimossi. Ricerche e riepiloghi successivi richiederanno nuove query di rete e consumeranno quota API.
ja: キャッシュされたすべての外部検索結果（グローバル検索＋AI外部コンテキスト）が削除されます。以降の検索と要約ではネットワークに再問い合わせを行い、APIクォータを消費します。
ko: 캐시된 모든 외부 검색 결과(전역 검색 + AI 외부 컨텍스트)가 제거됩니다. 이후 검색 및 요약은 네트워크에 다시 쿼리하고 API 할당량을 소비합니다.
nl: Alle gecachete externe zoekresultaten (globaal zoeken + AI externe context) worden verwijderd. Volgende zoekopdrachten en samenvattingen zullen opnieuw het netwerk bevragen en API-quota verbruiken.
pl: Wszystkie zapisane wyniki wyszukiwania zewnętrznego (wyszukiwanie globalne + zewnętrzny kontekst AI) zostaną usunięte. Kolejne wyszukiwania i podsumowania będą ponownie wysyłać zapytania do sieci i zużywać limit API.
pt_br: Todos os resultados de Pesquisa Externa em cache (pesquisa global + contexto externo de IA) serão removidos. Pesquisas e resumos subsequentes consultarão a rede novamente e consumirão cota de API.
ru: Все кэшированные результаты внешнего поиска (глобальный поиск + внешний контекст ИИ) будут удалены. Последующие поиски и сводки будут повторно запрашивать сеть и расходовать квоту API.
tr: Önbelleğe alınmış tüm Harici Arama sonuçları (genel arama + AI harici bağlam) kaldırılacak. Sonraki aramalar ve özetler ağı tekrar sorgulayacak ve API kotasını tüketecektir.
uk: Усі кешовані результати зовнішнього пошуку (глобальний пошук + зовнішній контекст AI) буде видалено. Подальші пошуки та підсумки повторно виконуватимуть мережеві запити та витрачатимуть квоту API.
vi: Tất cả kết quả tìm kiếm bên ngoài đã lưu (tìm kiếm toàn cục + ngữ cảnh AI bên ngoài) sẽ bị xóa. Các tìm kiếm và tóm tắt sau sẽ truy vấn lại mạng và tiêu tốn hạn mức API.
zh_hans: 已缓存的所有 External Search 检索结果（全局搜索 + AI 外部上下文）将被清空。下一次搜索 / 摘要会重新打网络,并消耗 API 配额。
zh_hant: 已缓存的所有外部搜索结果（全局搜索 + AI 外部上下文）将被清空。后续搜索和摘要将重新查询网络并消耗 API 配额。

# settings.storage.clearArchive.confirm
source: Clear downloaded repository ZIPs?
ar: مسح ملفات ZIP للمستودعات المحمّلة؟
de: Heruntergeladene Repository-ZIPs löschen?
es: ¿Limpiar los ZIP de repositorios descargados?
fr: Effacer les ZIP de dépôts téléchargés ?
id: Hapus ZIP repositori yang diunduh?
it: Cancellare i ZIP repository scaricati?
ja: ダウンロードしたリポジトリZIPをクリアしますか？
ko: 다운로드된 저장소 ZIP을 지우시겠습니까?
nl: Gedownloade repository-ZIP's wissen?
pl: Wyczyścić pobrane archiwa ZIP repozytoriów?
pt_br: Limpar ZIPs de repositórios baixados?
ru: Очистить загруженные ZIP-архивы репозиториев?
tr: İndirilen depo ZIP'leri temizlensin mi?
uk: Очистити завантажені ZIP-архіви репозиторіїв?
vi: Xóa các tệp ZIP kho đã tải về?
zh_hans: 清除已下载的仓库 ZIP？
zh_hant: 清除已下载的仓库 ZIP？

# settings.storage.clearArchive.message
source: CodeFlow or AI context generation will download the repository ZIP again when needed.
ar: سيقوم CodeFlow أو إنشاء سياق الذكاء الاصطناعي بتنزيل ملف ZIP للمستودع مرة أخرى عند الحاجة.
de: CodeFlow oder KI-Kontextgenerierung laden das Repository-ZIP bei Bedarf erneut herunter.
es: CodeFlow o la generación de contexto de IA descargarán el ZIP del repositorio nuevamente cuando sea necesario.
fr: La génération de CodeFlow ou de contexte IA téléchargera à nouveau le ZIP du dépôt si nécessaire.
id: CodeFlow atau pembuatan konteks AI akan mengunduh ZIP repositori lagi saat diperlukan.
it: CodeFlow o la generazione del contesto AI scaricheranno nuovamente il ZIP del repository quando necessario.
ja: CodeFlowまたはAIコンテキスト生成時に、必要に応じてリポジトリZIPが再度ダウンロードされます。
ko: CodeFlow 또는 AI 컨텍스트 생성 시 필요하면 저장소 ZIP을 다시 다운로드합니다.
nl: CodeFlow of AI-contextgeneratie zal de repository-ZIP indien nodig opnieuw downloaden.
pl: CodeFlow lub generowanie kontekstu AI pobierze ponownie archiwum ZIP repozytorium w razie potrzeby.
pt_br: O CodeFlow ou a geração de contexto de IA baixará o ZIP do repositório novamente quando necessário.
ru: CodeFlow или генерация контекста ИИ при необходимости загрузят ZIP репозитория снова.
tr: CodeFlow veya AI bağlam oluşturma, gerektiğinde depo ZIP'ini tekrar indirecektir.
uk: CodeFlow або генерація контексту AI за потреби знову завантажать ZIP-архів репозиторію.
vi: CodeFlow hoặc tạo ngữ cảnh AI sẽ tải lại ZIP kho khi cần.
zh_hans: 下次生成 CodeFlow 或 代码上下文时会按需重新下载。
zh_hant: 下次生成 CodeFlow 或代码上下文时会按需重新下载。

# settings.storage.clearChatHistory.confirm
source: Clear all repo AI assistant chat history?
ar: مسح كل سجل محادثة مساعد الذكاء الاصطناعي للمستودع؟
de: Gesamten Repository-KI-Assistenten-Chatverlauf löschen?
es: ¿Limpiar todo el historial de chat de IA del repositorio?
fr: Effacer tout l'historique des discussions de l'assistant IA du dépôt ?
id: Hapus semua riwayat obrolan asisten AI repo?
it: Cancellare tutta la cronologia chat AI del repository?
ja: すべてのリポジトリAIアシスタントのチャット履歴をクリアしますか？
ko: 모든 저장소 AI 어시스턴트 채팅 기록을 지우시겠습니까?
nl: Alle repo AI-assistent-chatgeschiedenis wissen?
pl: Wyczyścić całą historię czatu asystenta AI repozytorium?
pt_br: Limpar todo o histórico de chat do assistente de IA do repositório?
ru: Очистить всю историю чата ИИ репозитория?
tr: Tüm depo AI asistan sohbet geçmişi temizlensin mi?
uk: Очистити всю історію чату AI-помічника репозиторію?
vi: Xóa tất cả lịch sử trò chuyện AI kho?
zh_hans: 确认清除所有仓库 AI 对话历史？
zh_hant: 确认清除所有仓库 AI 助手对话历史？
